tap "asmvik/formulae"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "jackielii/tap"
tap "jetbrains/utils", "https://github.com/JetBrains/homebrew-utils", trusted: true
# Library for command-line editing
brew "readline"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Debugger for the Go programming language
brew "delve"
# Powerful, lightweight programming language
brew "lua"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# General-purpose data compression with high compression ratio
brew "xz"
# Language Server for the Lua language
brew "lua-language-server"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Node.js version manager
brew "nodenv"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Tool Command Language
brew "tcl-tk"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# General-purpose lossless data-compression library
brew "zlib"
# A tiling window manager for macOS based on binary space partitioning.
brew "asmvik/formulae/yabai", trusted: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Java IDE by JetBrains
cask "intellij-idea"
# Keyboard customiser
cask "karabiner-elements"
# Official Kotlin Language Server
cask "kotlin-lsp"
# Customise mouse behavior
cask "linearmouse"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Simple hotkey daemon written in Zig
cask "jackielii/tap/skhd-zig", trusted: true
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
go "cmd/go"
go "cmd/gofmt"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "github.com/a-h/templ/cmd/templ"
npm "corepack"
